[
  {
    "title": "Construção do Bot",
    "link": "/construção-do-bot",
    "image": "https://i.imgur.com/UwEcxTP.png",
    "text": "Para iniciarmos, precisamos compreender o que é um Chatbot, e qual a sua função. Um Chatbot é um sistema de criação de inteligência artificial, que produz respostas automáticas para seus usuários, dentro de um chat de mensagens. Dessa forma, é integrado a empresas, hospitais, cafeterias e demais comércios. Personalizado a sua maneira, e inserido aonde desejar.Entretanto, para que a Integração seja concebida é necessário saber como funciona cada parte de uma “criação”. Vamos lá?!",
    "video": "https://www.youtube.com/embed/JfeIPKewIXI",
    "submenus": [
      {
        "title": "Criando seu Bot",
        "link": "/criando-seu-bot",
        "text1": "Local que será inserido o fluxo de mensagens, ordem e organização de conversas, e a personalização do mesmo.",
        "text2": ""
      },
      {
        "title": "Blocos",
        "link": "/blocos",
        "text1": "Local que será inserido o fluxo de mensagens, ordem e organização de conversas, e a personalização do mesmo.",
        "text2": ""
      }
    ]
  },
  {
    "title": "Desenvolvendo Conversa",
    "link": "/desenvolvendo-conversa",
    "image": "https://imgur.com/XXP92Zh.png",
    "text": "Neste campo, a Inteligência artificial guarda informações acrescentadas nos “balões-chat”, cria um fluxo de conversas e aguarda a resposta do usuário/cliente.",
    "video": "https://www.youtube.com/embed/7xBBuwyx4s8",
    "submenus": [
      {
        "title": "Conversas",
        "link": "/conversas",
        "text1": "Adicionando seu primeiro texto, o usuário precisará de algumas ferramentas que o ajudarão nesse processo de criação.",
        "text2": ""
      },
      {
        "title": "Tempo entre mensagens (!)",
        "link": "/tempo-entre-mensagens(!)",
        "text1": "Classificado com a cor Laranja, como o próprio nome nos descreve, está opção permite que o usuário adicione um tempo entre as mensagens. Está função é executada quando, ao início de uma frase o usuário insere (!) exclamação, como comando para o bot. Exemplo: !2000. Desta forma o tempo será adicionado.",
        "text2": ""
      },
      {
        "title": "Variável ($)",
        "link": "/variável($)",
        "text1": "Ao adicionar ($) ao início de uma palavra-chave, o usuário cria uma variável. Classificado com a cor verde, está opção comunica ao bot, que aquele bloco necessita de uma resposta do cliente, ou seja, o cliente só sairá do mesmo, caso a variável seja respondida. Se o tempo expirar, ou não houver resposta, o cliente será redirecionado para outro bloco. Exemplo: Abandono.",
        "text2": ""
      },
      {
        "title": "Setas (^)",
        "link": "/setas(^)",
        "text1": "Após realizar qualquer alteração, ou criar um novo bloco, o usuário precisa clicar no botão “SALVAR”, para que seu trabalho seja salvo, caso contrário as informações adicionadas ao chat, não serão aplicadas.",
        "text2": ""
      },
      {
        "title": "Salvar",
        "link": "/salvar",
        "text1": "Ao adicionar ($) ao início de uma palavra-chave, o usuário cria uma variável. Classificado com a cor verde, está opção comunica ao bot, que aquele bloco necessita de uma resposta do cliente, ou seja, o cliente só sairá do mesmo, caso a variável seja respondida. Se o tempo expirar, ou não houver resposta, o cliente será redirecionado para outro bloco. Exemplo: Abandono.",
        "text2": ""
      },
      {
        "title": "Upload",
        "link": "/upload",
        "text1": "Está nuvem concede ao usuário, a opção de acrescentar e adicionar arquivos de imagem e vídeo a conversa.",
        "text2": ""
      }
    ]
  },
  {
    "title": "Criando Condições",
    "link": "/criando-condições",
    "image": "https://imgur.com/ncQi2Wm.png",
    "text": "As condições servem para criar uma organização estável em seu chat, determina ações transferindo o cliente de um bloco para outro. Dessa forma seu projeto não se transforma em uma verdadeira bagunça.",
    "video": "https://www.youtube.com/embed/EE-4GvjKcfs",
    "submenus": [
      {
        "title": "Condições de Saída",
        "link": "/condições-de-saída",
        "text1": "Está condição permite que ao finalizar uma conversa, o cliente ou usuário, seja redirecionado para outro bloco. Exemplo: depois que o cliente finalizar uma conversa no bloco “nome”, o usuário cria uma condição que o redirecionará para o bloco 'telefone'.",
        "text2": ""
      },
      {
        "title": "Condição Dinâmica",
        "link": "/condição-dinâmica",
        "text1": "Como o próprio nome nos leva a concluir, está é uma condição dinâmica, ou seja, uma condição flexível. Está opção permite que o usuário crie uma saída a qualquer momento da conversa, ou seja, cria-se uma condição que o da liberdade para sair em qualquer parte da conversa, de um bloco para outro.",
        "text2": ""
      }
    ]
  },
  {
    "title": "Tempo de expiração",
    "link": "/tempo-de-expiração",
    "image": "https://imgur.com/vGkRKv8.png",
    "text": "Neste tópico, como o significado literal da palavra, o usuário pode adicionar um “tempo-limite” para cada bloco criado, caso o cliente não responda à pergunta.",
    "video": "https://www.youtube.com/embed/pKUu6PKNyzk",
    "submenus": [
      {
        "title": "Tempo Limite ou Tempo de Expiração",
        "link": "/tempo-limite-ou-tempo-de-expiração",
        "text1": "Está opção determina o prazo que cada bloco expira (tempo limite do bloco), após a escolha do limite de tempo, o usuário pode escolher qual o bloco de destino, que seu cliente será redirecionado após a expiração.",
        "text2": ""
      }
    ]
  },
  {
    "title": "Testando seu Chatbot",
    "link": "/testando-seu-chatbot",
    "image": "https://imgur.com/ih434lM.png",
    "text": "Já imaginou criar um projeto com a visão de vendedor e consumidor? Com está opção é possível!",
    "video": "https://www.youtube.com/embed/7ksH7-9vWZ0",
    "submenus": [
      {
        "title": "Testar Bot",
        "link": "/testar-bot",
        "text1": "Local de chat onde o usuário poderá ter uma experiência real como cliente, e testar seu Chatbot. Permite que o usuário faça perguntas, e descubra potenciais erros de escrita, “bugs”, ou até mesmo falhas na configuração. Está opção dará ao usuário, a vantagem de consertar erros, apreciar o resultado da Inteligência Artificial, a confiança de que seu trabalho e esforço valeram a pena, e a segurança de que seu bot chegará impecável ao seu cliente.",
        "text2": ""
      }
    ]
  },
  {
    "title": "Opções de entrada e saída",
    "link": "/opções-de-entrada-e-saída",
    "image": "https://imgur.com/uM0s96d",
    "text": "As opções de entrada e saída servem para receber e enviar dados ou até para criar um comando novo.",
    "video": "https://www.youtube.com/embed/MKrUZ36IVAY",
    "submenus": [
      {
        "title": "HTTP",
        "link": "/http",
        "text1": "Consiste em receber e enviar dados a outras API´s e externas.",
        "text2": ""
      },
      {
        "title": "Executar Script",
        "link": "/executar-script",
        "text1": "Permite que o usuário execute um comando ao bot, utilizando uma nova linha de código criada pelo mesmo.",
        "text2": ""
      }
    ]
  },
  {
    "title": "Template",
    "link": "/template",
    "image": "https://imgur.com/bDqgiPJ.png",
    "text": "A template, representada por {{1}}, é o primeiro contato de usuário com o cliente.",
    "video": "https://www.youtube.com/embed/gmA6MrX81z4",
    "submenus": [
      {
        "title": "Executar Template",
        "link": "/executar-template",
        "text1": "Nesta opção é possível que o usuário possa criar até três botões de opções.A template necessita de uma aprovação, que pode levar aproximadamente 24hrs.Também é possível adicionar uma template como mensagem durante uma conversa; está é a única forma de criar um botão. Ainda em “Templates”, o usuário pode adicionar qualquer palavra, ou ação, através de uma ou mais variáveis.",
        "text2": ""
      }
    ]
  },
  {
    "title": "Disparo",
    "link": "/disparo",
    "image": "https://imgur.com/TGYwCPR.png",
    "text": "Como um real disparo, o usuário pode otimizar seu tempo e “disparar” várias templates ao mesmo tempo, para vários clientes.",
    "video": "https://www.youtube.com/embed/LembwKDo1Dk",
    "submenus": [
      {
        "title": "Executar Disparo",
        "link": "/executar-disparo",
        "text1": "Esta ferramenta que permite, que o usuário envie uma template para vários clientes ao mesmo tempo, através de uma planilha; A planilha necessita de pelo menos um campo chamado “Telefone” ou “Contato”, no qual será enviado a mensagem para o cliente.",
        "text2": ""
      }
    ]
  }
]